In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame([[1,2,3,4],[4,5,6,7],[8,9,10,11]], index=list('ABC'),
                                                  columns=list('efgh'))
df

   e  f   g   h
A  1  2   3   4
B  4  5   6   7
C  8  9  10  11

In [3]:
df.loc["Large",:] = df.loc["A"] >= 5
df

           e      f      g      h
A        1.0    2.0    3.0    4.0
B        4.0    5.0    6.0    7.0
C        8.0    9.0   10.0   11.0
Large  False  False  False  False

In [5]:
df = pd.DataFrame([[4,5,6,7],[8,9,10,11],[1,2,3,4]],
                  index=list('ABC'), columns=list('efgh'))
# dfnew = df.sort_values(by="e", ascending=False)
df.sort_values(by="e", ascending=False, inplace=True)
df

   e  f   g   h
B  8  9  10  11
A  4  5   6   7
C  1  2   3   4

In [12]:
df = pd.DataFrame([[4,5,6,7],[8,9,10,11],[1,2,3,4]], 
                     index=list('ABC'), columns=list('efgh'))
print(df.drop("e", axis = 1))
print()
print(df.drop(["A","B"], axis = 0))

   f   g   h
A  5   6   7
B  9  10  11
C  2   3   4

     e  f  g  h
C  1.0  2  3  4

In [18]:
df = pd.DataFrame([[np.nan,2,3,4],[4,5,6,7],[8,9,10,11]], index=list('ABC'),
                                                  columns=list('efgh'))
mod_df = df.dropna(inplace = False, axis = 0) 
mod_df

     e  f   g   h
B  4.0  5   6   7
C  8.0  9  10  11

In [23]:
df.loc[:,'e'].isna().sum()

1

In [25]:
df.loc["MAX"] = df.max(axis = 0)
df

       e    f     g     h
A    NaN  2.0   3.0   4.0
B    4.0  5.0   6.0   7.0
C    8.0  9.0  10.0  11.0
MAX  8.0  9.0  10.0  11.0

In [26]:
df["max_squared"] = df.max(axis = 1) ** 2
df

       e    f     g     h  max_squared
A    NaN  2.0   3.0   4.0         16.0
B    4.0  5.0   6.0   7.0         49.0
C    8.0  9.0  10.0  11.0        121.0
MAX  8.0  9.0  10.0  11.0        121.0

In [28]:
df = pd.DataFrame([["Megan",90,80,94],["Bohong",90,89,92],["Marylyn",91,93,95]],index=list('ABC'),columns=['name','T1','T2','Final'])
df.groupby("T1").mean()

      T2  Final
T1
90  84.5   93.0
91  93.0   95.0